Revit 2026 API

# RebarSplice Properties

---

The RebarSplice type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectedRebarEnd | Identifies the end of the connected rebar which is part of this splice - 0 for start, 1 for end. |
|  | ConnectedRebarId | Identifies the connected rebar id of this rebar splice object. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SourceRebarEnd | Identifies the end of the source rebar which is part of this rebar splice - 0 for start, 1 for end. The source rebar is the one from which this rebar splice was obtained. |
|  | SourceRebarId | Identifies the source of the target rebar which is part of this rebar splice. The source rebar is the one from which this rebar splice was obtained. |
|  | SplicePosition | Identifies the splice position. |
|  | SpliceTypeId | Identifies the id of the Rebar Splice Type. |

#### Reference

RebarSplice Class

Autodesk.Revit.DB.Structure Namespace